espressif/esp-idf/components/soc/esp32s2/register/soc/apb_saradc_reg.h
#define APB_SARADC_FILTER_CTRL_REG          (DR_REG_APB_SARADC_BASE + 0x03C)
/* APB_SARADC_ADC1_FILTER_EN : R/W ;bitpos:[31] ;default: 1'b0 ; */
/*description: enable apb_adc1_filter*/
#define APB_SARADC_ADC1_FILTER_EN  (BIT(31))
#define APB_SARADC_ADC1_FILTER_EN_M  (BIT(31))
#define APB_SARADC_ADC1_FILTER_EN_V  0x1
#define APB_SARADC_ADC1_FILTER_EN_S  31
/* APB_SARADC_ADC2_FILTER_EN : R/W ;bitpos:[30] ;default: 1'b0 ; */
/*description: enable apb_adc2_filter*/
#define APB_SARADC_ADC2_FILTER_EN  (BIT(30))
#define APB_SARADC_ADC2_FILTER_EN_M  (BIT(30))
#define APB_SARADC_ADC2_FILTER_EN_V  0x1
#define APB_SARADC_ADC2_FILTER_EN_S  30
/* APB_SARADC_ADC1_FILTER_FACTOR : R/W ;bitpos:[29:23] ;default: 7'd64 ; */
/*description: apb_adc1_filter_factor*/
#define APB_SARADC_ADC1_FILTER_FACTOR  0x0000007F
#define APB_SARADC_ADC1_FILTER_FACTOR_M  ((APB_SARADC_ADC1_FILTER_FACTOR_V)<<(APB_SARADC_ADC1_FILTER_FACTOR_S))
#define APB_SARADC_ADC1_FILTER_FACTOR_V  0x7F
#define APB_SARADC_ADC1_FILTER_FACTOR_S  23
/* APB_SARADC_ADC2_FILTER_FACTOR : R/W ;bitpos:[22:16] ;default: 7'd64 ; */
/*description: apb_adc2_filter_factor*/
#define APB_SARADC_ADC2_FILTER_FACTOR  0x0000007F
#define APB_SARADC_ADC2_FILTER_FACTOR_M  ((APB_SARADC_ADC2_FILTER_FACTOR_V)<<(APB_SARADC_ADC2_FILTER_FACTOR_S))
#define APB_SARADC_ADC2_FILTER_FACTOR_V  0x7F
#define APB_SARADC_ADC2_FILTER_FACTOR_S  16
/* APB_SARADC_ADC1_FILTER_RESET : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: reset_adc1_filter*/
#define APB_SARADC_ADC1_FILTER_RESET  (BIT(1))
#define APB_SARADC_ADC1_FILTER_RESET_M  (BIT(1))
#define APB_SARADC_ADC1_FILTER_RESET_V  0x1
#define APB_SARADC_ADC1_FILTER_RESET_S  1
/* APB_SARADC_ADC2_FILTER_RESET : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: reset_adc2_filter*/
#define APB_SARADC_ADC2_FILTER_RESET  (BIT(0))
#define APB_SARADC_ADC2_FILTER_RESET_M  (BIT(0))
#define APB_SARADC_ADC2_FILTER_RESET_V  0x1
#define APB_SARADC_ADC2_FILTER_RESET_S  0

#define APB_SARADC_FILTER_STATUS_REG          (DR_REG_APB_SARADC_BASE + 0x040)
/* APB_SARADC_ADC1_FILTER_DATA : RO ;bitpos:[31:16] ;default: 16'd0 ; */
/*description: */
#define APB_SARADC_ADC1_FILTER_DATA  0x0000FFFF
#define APB_SARADC_ADC1_FILTER_DATA_M  ((APB_SARADC_ADC1_FILTER_DATA_V)<<(APB_SARADC_ADC1_FILTER_DATA_S))
#define APB_SARADC_ADC1_FILTER_DATA_V  0xFFFF
#define APB_SARADC_ADC1_FILTER_DATA_S  16
/* APB_SARADC_ADC2_FILTER_DATA : RO ;bitpos:[15:0] ;default: 16'd0 ; */
/*description: */
#define APB_SARADC_ADC2_FILTER_DATA  0x0000FFFF
#define APB_SARADC_ADC2_FILTER_DATA_M  ((APB_SARADC_ADC2_FILTER_DATA_V)<<(APB_SARADC_ADC2_FILTER_DATA_S))
#define APB_SARADC_ADC2_FILTER_DATA_V  0xFFFF
#define APB_SARADC_ADC2_FILTER_DATA_S  0

#define APB_SARADC_THRES_CTRL_REG          (DR_REG_APB_SARADC_BASE + 0x044)
/* APB_SARADC_ADC1_THRES_EN : R/W ;bitpos:[31] ;default: 1'b0 ; */
/*description: */
#define APB_SARADC_ADC1_THRES_EN  (BIT(31))
#define APB_SARADC_ADC1_THRES_EN_M  (BIT(31))
#define APB_SARADC_ADC1_THRES_EN_V  0x1
#define APB_SARADC_ADC1_THRES_EN_S  31
/* APB_SARADC_ADC2_THRES_EN : R/W ;bitpos:[30] ;default: 1'b0 ; */
/*description: */
#define APB_SARADC_ADC2_THRES_EN  (BIT(30))
#define APB_SARADC_ADC2_THRES_EN_M  (BIT(30))
#define APB_SARADC_ADC2_THRES_EN_V  0x1
#define APB_SARADC_ADC2_THRES_EN_S  30
/* APB_SARADC_ADC1_THRES : R/W ;bitpos:[29:17] ;default: 13'd0 ; */
/*description: */
#define APB_SARADC_ADC1_THRES  0x00001FFF
#define APB_SARADC_ADC1_THRES_M  ((APB_SARADC_ADC1_THRES_V)<<(APB_SARADC_ADC1_THRES_S))
#define APB_SARADC_ADC1_THRES_V  0x1FFF
#define APB_SARADC_ADC1_THRES_S  17
/* APB_SARADC_ADC2_THRES : R/W ;bitpos:[16:4] ;default: 13'd0 ; */
/*description: */
#define APB_SARADC_ADC2_THRES  0x00001FFF
#define APB_SARADC_ADC2_THRES_M  ((APB_SARADC_ADC2_THRES_V)<<(APB_SARADC_ADC2_THRES_S))
#define APB_SARADC_ADC2_THRES_V  0x1FFF
#define APB_SARADC_ADC2_THRES_S  4
/* APB_SARADC_ADC1_THRES_MODE : R/W ;bitpos:[3] ;default: 1'h0 ; */
/*description: */
#define APB_SARADC_ADC1_THRES_MODE  (BIT(3))
#define APB_SARADC_ADC1_THRES_MODE_M  (BIT(3))
#define APB_SARADC_ADC1_THRES_MODE_V  0x1
#define APB_SARADC_ADC1_THRES_MODE_S  3
/* APB_SARADC_ADC2_THRES_MODE : R/W ;bitpos:[2] ;default: 1'h0 ; */
/*description: */
#define APB_SARADC_ADC2_THRES_MODE  (BIT(2))
#define APB_SARADC_ADC2_THRES_MODE_M  (BIT(2))
#define APB_SARADC_ADC2_THRES_MODE_V  0x1
#define APB_SARADC_ADC2_THRES_MODE_S  2
/* APB_SARADC_CLK_EN : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: */
#define APB_SARADC_CLK_EN  (BIT(0))
#define APB_SARADC_CLK_EN_M  (BIT(0))
#define APB_SARADC_CLK_EN_V  0x1
#define APB_SARADC_CLK_EN_S  0

#define APB_SARADC_INT_ENA_REG          (DR_REG_APB_SARADC_BASE + 0x048)
/* APB_SARADC_ADC1_DONE_INT_ENA : R/W ;bitpos:[31] ;default: 1'b0 ; */
/*description: */
#define APB_SARADC_ADC1_DONE_INT_ENA  (BIT(31))
#define APB_SARADC_ADC1_DONE_INT_ENA_M  (BIT(31))
#define APB_SARADC_ADC1_DONE_INT_ENA_V  0x1
#define APB_SARADC_ADC1_DONE_INT_ENA_S  31
/* APB_SARADC_ADC2_DONE_INT_ENA : R/W ;bitpos:[30] ;default: 1'b0 ; */
/*description: */
#define APB_SARADC_ADC2_DONE_INT_ENA  (BIT(30))
#define APB_SARADC_ADC2_DONE_INT_ENA_M  (BIT(30))
#define APB_SARADC_ADC2_DONE_INT_ENA_V  0x1
#define APB_SARADC_ADC2_DONE_INT_ENA_S  30
/* APB_SARADC_ADC1_THRES_INT_ENA : R/W ;bitpos:[29] ;default: 1'b0 ; */
/*description: */
#define APB_SARADC_ADC1_THRES_INT_ENA  (BIT(29))
#define APB_SARADC_ADC1_THRES_INT_ENA_M  (BIT(29))
#define APB_SARADC_ADC1_THRES_INT_ENA_V  0x1
#define APB_SARADC_ADC1_THRES_INT_ENA_S  29
/* APB_SARADC_ADC2_THRES_INT_ENA : R/W ;bitpos:[28] ;default: 1'b0 ; */
/*description: */
#define APB_SARADC_ADC2_THRES_INT_ENA  (BIT(28))
#define APB_SARADC_ADC2_THRES_INT_ENA_M  (BIT(28))
#define APB_SARADC_ADC2_THRES_INT_ENA_V  0x1
#define APB_SARADC_ADC2_THRES_INT_ENA_S  28

#define APB_SARADC_INT_RAW_REG          (DR_REG_APB_SARADC_BASE + 0x04C)
/* APB_SARADC_ADC1_DONE_INT_RAW : RO ;bitpos:[31] ;default: 1'b0 ; */
/*description: */
#define APB_SARADC_ADC1_DONE_INT_RAW  (BIT(31))
#define APB_SARADC_ADC1_DONE_INT_RAW_M  (BIT(31))
#define APB_SARADC_ADC1_DONE_INT_RAW_V  0x1
#define APB_SARADC_ADC1_DONE_INT_RAW_S  31
/* APB_SARADC_ADC2_DONE_INT_RAW : RO ;bitpos:[30] ;default: 1'b0 ; */
/*description: */
#define APB_SARADC_ADC2_DONE_INT_RAW  (BIT(30))
#define APB_SARADC_ADC2_DONE_INT_RAW_M  (BIT(30))
#define APB_SARADC_ADC2_DONE_INT_RAW_V  0x1
#define APB_SARADC_ADC2_DONE_INT_RAW_S  30
/* APB_SARADC_ADC1_THRES_INT_RAW : RO ;bitpos:[29] ;default: 1'b0 ; */
/*description: */
#define APB_SARADC_ADC1_THRES_INT_RAW  (BIT(29))
#define APB_SARADC_ADC1_THRES_INT_RAW_M  (BIT(29))
#define APB_SARADC_ADC1_THRES_INT_RAW_V  0x1
#define APB_SARADC_ADC1_THRES_INT_RAW_S  29
/* APB_SARADC_ADC2_THRES_INT_RAW : RO ;bitpos:[28] ;default: 1'b0 ; */
/*description: */
#define APB_SARADC_ADC2_THRES_INT_RAW  (BIT(28))
#define APB_SARADC_ADC2_THRES_INT_RAW_M  (BIT(28))
#define APB_SARADC_ADC2_THRES_INT_RAW_V  0x1
#define APB_SARADC_ADC2_THRES_INT_RAW_S  28

#define APB_SARADC_INT_ST_REG          (DR_REG_APB_SARADC_BASE + 0x050)
/* APB_SARADC_ADC1_DONE_INT_ST : RO ;bitpos:[31] ;default: 1'b0 ; */
/*description: */
#define APB_SARADC_ADC1_DONE_INT_ST  (BIT(31))
#define APB_SARADC_ADC1_DONE_INT_ST_M  (BIT(31))
#define APB_SARADC_ADC1_DONE_INT_ST_V  0x1
#define APB_SARADC_ADC1_DONE_INT_ST_S  31
/* APB_SARADC_ADC2_DONE_INT_ST : RO ;bitpos:[30] ;default: 1'b0 ; */
/*description: */
#define APB_SARADC_ADC2_DONE_INT_ST  (BIT(30))
#define APB_SARADC_ADC2_DONE_INT_ST_M  (BIT(30))
#define APB_SARADC_ADC2_DONE_INT_ST_V  0x1
#define APB_SARADC_ADC2_DONE_INT_ST_S  30
/* APB_SARADC_ADC1_THRES_INT_ST : RO ;bitpos:[29] ;default: 1'b0 ; */
/*description: */
#define APB_SARADC_ADC1_THRES_INT_ST  (BIT(29))
#define APB_SARADC_ADC1_THRES_INT_ST_M  (BIT(29))
#define APB_SARADC_ADC1_THRES_INT_ST_V  0x1
#define APB_SARADC_ADC1_THRES_INT_ST_S  29
/* APB_SARADC_ADC2_THRES_INT_ST : RO ;bitpos:[28] ;default: 1'b0 ; */
/*description: */
#define APB_SARADC_ADC2_THRES_INT_ST  (BIT(28))
#define APB_SARADC_ADC2_THRES_INT_ST_M  (BIT(28))
#define APB_SARADC_ADC2_THRES_INT_ST_V  0x1
#define APB_SARADC_ADC2_THRES_INT_ST_S  28

